
/*

百钱百鸡问题优化一：

5公鸡+3母鸡+1/3小鸡 = 100
公鸡+母鸡+小鸡 = 100

缩小枚举范围

枚举变量：公鸡、母鸡、小鸡
枚举范围：公鸡1-18，母鸡1-32 ，小鸡1-98次，总计算次数18*32*98
枚举判断条件：
钱数=100：5公鸡+3母鸡+1/3小鸡 = 100
总鸡数=100：公鸡+母鸡+小鸡 = 100
小鸡%3==0


*/

#include <stdio.h>
int main()
{
    for (int i = 1; i <= 18; i++)
        for (int j = 1; j <= 32; j++)
            for (int k = 1; k <= 98; k++)
            {
                if (5 * i + 3 * j + k / 3 == 100 && k % 3 == 0 && i + j + k == 100)
                {
                    printf("公鸡 %2d 只，母鸡 %2d 只，小鸡 %2d 只\n", i, j, k);
                }
            }
    return 0;
}
