
/*

钱数=100：5公鸡+3母鸡+1/3小鸡 = 100
总鸡数=100：公鸡+母鸡+小鸡 = 100

设公鸡 x 只，母鸡 y 只，小鸡 z 只

5x+3y+1/3z = 100
x+y+z = 100

枚举了x和y之后，z的值是固定的，z=100-x-y
所以这个时候，z就不用枚举了

枚举变量：公鸡，母鸡
枚举范围：公鸡1-18,母鸡1-32，总计算次数 18*32
枚举判断条件：
钱数=100：5公鸡+3母鸡+1/3小鸡 = 100
小鸡%3==0

优化：减少了枚举的变量
减少枚举的变量之后，枚举的次数大幅减少

*/
#include <stdio.h>
int main()
{
    for (int i = 1; i <= 18; i++)
        for (int j = 1; j <= 32; j++)
        {
            int z = 100 - i - j;
            if (5 * i + 3 * j + z / 3 == 100 && z % 3 == 0)
            {
                printf("公鸡 %2d 只，母鸡 %2d 只，小鸡 %2d 只\n", i, j, z);
            }
        }

    return 0;
}
