/*

钱数=100：5公鸡+3母鸡+1/3小鸡 = 100
总鸡数=100：公鸡+母鸡+小鸡 = 100

设公鸡 x 只，母鸡 y 只，小鸡 z 只

5x+3y+1/3z = 100
x+y+z = 100

第一个式子*3
15x+9y+z = 300
x+y+z = 100

得：
14x+8y=200
即
7x+4y=100
y=(100-7x)/4
z=100-x-(100-7x)/4

根据这个式子，有x之后，我们就可以得到y，从而得到z
这里7x小于等于96，x取值为1-14

枚举变量：公鸡
枚举范围：公鸡1-14，总计算次数14
枚举判断条件：
钱数=100：5公鸡+3母鸡+1/3小鸡 = 100
小鸡%3==0
(100-7x)%4==0


*/
#include <stdio.h>
int main()
{
    for (int i = 1; i <= 14; i++)
    {
        if ((100 - 7 * i) % 4 == 0)
        {
            int y = (100 - 7 * i) / 4;
            int z = 100 - i - y;
            if (5 * i + 3 * y + z / 3 == 100 && z % 3 == 0)
            {
                printf("公鸡 %2d 只，母鸡 %2d 只，小鸡 %2d 只\n", i, y, z);
            }
        }
    }

    return 0;
}
